import type { LectureDetail } from '@models'

export const lectureData: LectureDetail[] = [
  {
    id: 'd4460690-073c-47c0-aefc-cc68cbca6ced',
    lectureTitle: '무료 AI 꿀팁 가이드',
    instructor: 'AI 튜터랩',
    duration: 16,
    description:
      '요즘 화제인 생성형 AI, 아직도 유료 구독이 망설여지시나요? 이 강의는 여러분의 그런 고민을 덜어드리기 위해 기획되었습니다. 저는 이벤트를 통해 얻은 1년 구독권과 무료 플랜을 활용하여 다양한 생성형 AI 툴을 깊이 있게 사용해봤습니다.  그 과정에서 발견한 실무 효율을 200% 올려주는 놀라운 사용법과 꿀팁들을 아낌없이 공유해 드립니다. 더 이상 AI를 어렵게 생각하지 마세요. 검색 엔진처럼 친숙한 Perplexity부터 아이디어 기획의 동반자 Gemini, 그리고 AI 모델들의 성능을 직접 비교 체험할 수 있는 LMArena까지, 여러분의 일상을 스마트하게 바꿔줄 도구들의 진짜 사용법을 알려드립니다.',
    updatedAt: '2025-09-29T00:01:03.306081+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 8,
        name: '인공지능 기타',
      },
      {
        id: 21,
        name: 'AI 크리에이티브',
      },
      {
        id: 23,
        name: 'AI 업무 활용',
      },
    ],
    difficulty: 'easy',
    originalPrice: 0,
    discountPrice: 0,
    platform: 'inflearn',
    urlLink: 'https://www.inflearn.com/course/무료-ai-꿀팁-가이드',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/339103/cover/01k6858gc9y76rznhahdmc7p9w',
    createdAt: '2025-09-29T00:01:03.306030+09:00',
  },
  {
    id: 'f815c7d4-fc9f-415e-a1e8-3ce10476dcf9',
    lectureTitle:
      '인프런 클론코딩으로 배우는 올인원 LMS 솔루션: Next.js·Flutter·AWS·Supabase로 구현하는 다국어 HLS 스트리밍 기반 MVP 프로젝트',
    instructor: 'ludgi',
    duration: 551,
    description:
      '이 강의는 단순한 클론코딩이나 기초 강의가 아닙니다. 인프런(Inflearn) 같은 LMS(Learning Management System) 플랫폼을 MVP(엠 브이 피) 수준으로 처음부터 끝까지 구현하면서, 프리랜서·1인 개발자·스타트업 초기 멤버가 실무에서 바로 활용할 수 있는 올인원 솔루션을 제공합니다.  Next.js, Flutter, Supabase, Firebase(FCM), AWS, Vercel, Xcode, Android Studio, ElevenLabs, 토스페이먼츠까지 실제 실무에서 사용하는 스택을 한 번에 다룹니다. 웹과 앱을 동시에 개발하고, 소셜 로그인, 다국어 자동 더빙, HLS 스트리밍 기반 강의 재생, 결제 연동, 앱스토어·플레이스토어 배포까지 전 과정을 직접 경험할 수 있습니다.  이 강의는 세세한 코드 한 줄보다는, 실무에서 중요한 흐름, 설정, 배포 과정에 중점을 두었습니다. 따라서 프리랜서로 독립하려는 개발자, 스타트업에서 빠르게 MVP를 검증해야 하는 팀, 그리고 실무 전반을 경험하고 싶은 주니어 개발자에게 적합합니다.',
    updatedAt: '2025-09-28T00:00:49.780790+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 1,
        name: '모바일 앱 개발',
      },
      {
        id: 42,
        name: '풀스택',
      },
      {
        id: 75,
        name: '웹 개발',
      },
    ],
    difficulty: 'easy',
    originalPrice: 286000,
    discountPrice: 85800,
    platform: 'inflearn',
    urlLink:
      'https://www.inflearn.com/course/인프런-클론코딩으로-배우는-올인원-l',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/338924/cover/01k64xh1npqjpgt0ty9se3r2kc',
    createdAt: '2025-09-28T00:00:49.780751+09:00',
  },
  {
    id: 'b1991f8e-b51a-4ddb-ba42-080566bf0a15',
    lectureTitle: "'향로' 와 함께하는 추석 완강 챌린지",
    instructor: '향로',
    duration: 0,
    description:
      '40% 강의 쿠폰도 받고, 연휴 동안 미션 완주하면 신청비까지 몽땅 환급! 향로와 함께하는 밑져야 본전 그 이상인 추석 챌린지!',
    updatedAt: '2025-09-27T00:00:46.583365+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 11,
        name: '교양',
      },
      {
        id: 13,
        name: '취업 · 이직',
      },
      {
        id: 61,
        name: '커리어 · 자기계발 기타',
      },
    ],
    difficulty: 'easy',
    originalPrice: 9900,
    discountPrice: 9900,
    platform: 'inflearn',
    urlLink: 'https://www.inflearn.com/course/x27향로x27-와-함께하는-추석-완',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/339081/cover/01k61sxn18rq855hpmw89fcn09',
    createdAt: '2025-09-27T00:00:46.583362+09:00',
  },
  {
    id: '2cabf2e5-fca2-49c5-834c-60a82ad3cf5e',
    lectureTitle: 'AI를 활용한 제조업 분야의 실무 적용 전략(전자/반도체 분야)',
    instructor: '바이트 탐정',
    duration: 224,
    description:
      '전자·반도체 산업은 초정밀 공정과 복잡한 공급망으로 인해 데이터 기반 관리와 혁신이 특히 중요한 분야입니다. 이 강의는 AI 기술을 활용하여 불량 검출, 공정 최적화, 예지보전, 공급망 관리 등 전자·반도체 제조업에서 바로 적용할 수 있는 실무 전략을 다룹니다.  글로벌 기업의 실제 사례와 함께, 중소·중견기업이 현실적으로 활용할 수 있는 저비용·고효율 AI 도입 방법도 제시합니다. 이를 통해 수강생은 생산성 향상과 비용 절감뿐 아니라, 미래 경쟁력을 갖추는 AI 기반 제조 전략을 이해하고 적용할 수 있게 됩니다.',
    updatedAt: '2025-09-27T00:00:46.583344+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 23,
        name: 'AI 업무 활용',
      },
      {
        id: 37,
        name: '컴퓨터 비전',
      },
      {
        id: 76,
        name: '딥러닝 · 머신러닝',
      },
    ],
    difficulty: 'easy',
    originalPrice: 66000,
    discountPrice: 33000,
    platform: 'inflearn',
    urlLink:
      'https://www.inflearn.com/course/ai를-활용한-제조업-분야의-실무-적-1',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/339045/cover/01k5vfpcd3stz88fa7ygg275nm',
    createdAt: '2025-09-27T00:00:46.583340+09:00',
  },
  {
    id: 'ea4c6888-d1b4-487b-a20f-a86f404bed2f',
    lectureTitle:
      '【2025년판】Unity×C# 입문 강좌｜2D 타워 디펜스 게임 개발 마스터｜클릭&배틀 시스템 만드는 방법',
    instructor: 'Sorappu',
    duration: 516,
    description:
      '클릭해서 캐릭터를 소환하고 서로 배틀하는 본격 2D 타워 디펜스 게임 개발 코스. 초본격적인 게임을 R3를 사용해 리액티브 프로그래밍 등을 활용한 확장성 높은 구현으로 배울 수 있습니다!',
    updatedAt: '2025-09-27T00:00:46.583322+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 39,
        name: '프로그래밍 언어',
      },
      {
        id: 63,
        name: '게임 프로그래밍',
      },
    ],
    difficulty: 'easy',
    originalPrice: 24200,
    discountPrice: 7260,
    platform: 'inflearn',
    urlLink: 'https://www.inflearn.com/course/2025unityc2damp',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/339066/cover/01k5zgr0zddkwb9bxz8n1b86f5',
    createdAt: '2025-09-27T00:00:46.583318+09:00',
  },
  {
    id: '31f00951-e722-4f78-a793-6ad62fd5c50f',
    lectureTitle: 'AI를 활용한 제조업 분야의 실무 적용 전략(자동차/부품 분야)',
    instructor: '바이트 탐정',
    duration: 222,
    description:
      '자동차 및 부품 제조 산업은 치열한 글로벌 경쟁과 복잡한 공급망 속에서 혁신이 필수적인 분야입니다. 본 강의는 AI 기술을 현장에 어떻게 적용할 수 있는지를 중심으로, 생산 효율 향상, 품질 검사 자동화, 설비 예지보전, 공급망 최적화 등 실제 사례와 함께 설명합니다.  AI 도입에 필요한 기초 이해부터, 현장 적용 시 고려해야 할 전략과 리스크 관리까지 단계적으로 다루어, 실무 담당자와 관리자가 바로 활용할 수 있는 지식과 통찰을 제공합니다.',
    updatedAt: '2025-09-27T00:00:46.583290+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 23,
        name: 'AI 업무 활용',
      },
      {
        id: 56,
        name: '데이터 분석',
      },
      {
        id: 76,
        name: '딥러닝 · 머신러닝',
      },
    ],
    difficulty: 'easy',
    originalPrice: 66000,
    discountPrice: 33000,
    platform: 'inflearn',
    urlLink:
      'https://www.inflearn.com/course/ai를-활용한-제조업-분야의-실무-적',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/339004/cover/01k5m0z8p0khkw8p15sr40fndv',
    createdAt: '2025-09-27T00:00:46.583284+09:00',
  },
  {
    id: 'c33ad19d-4362-4c1e-8435-06771bb0b5aa',
    lectureTitle: '주식입문자를 위한 적정주가 산정 및 가치주 선정 방법',
    instructor: '인프라투자전문가',
    duration: 40,
    description:
      '주식을 처음 접하는 분이라도 실전투자에 당장 적용가능 합니다.  특정 기업의 주가가 적정한 가격인지 알 수 있는 방법을 쉽게 설명드립니다.  나만의 가치주를 선정하실 수 있도록 쉽고 적용가능한 방법을 알려드립니다.  강의가 끝나시면, 주식입문자에서 가치주 투자자로 첫발을 내딛게 되실 겁니다. ',
    updatedAt: '2025-09-27T00:00:46.583184+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 7,
        name: '업무 생산성 기타',
      },
      {
        id: 64,
        name: '상경',
      },
      {
        id: 66,
        name: '금융 ·  재테크',
      },
    ],
    difficulty: 'easy',
    originalPrice: 33000,
    discountPrice: 16500,
    platform: 'inflearn',
    urlLink:
      'https://www.inflearn.com/course/주식입문자를-위한-적정주가-산정-및',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/339067/cover/01k5vadct8thwsa1bcjmyrpa6q',
    createdAt: '2025-09-27T00:00:46.583148+09:00',
  },
  {
    id: 'bc67a7f8-e967-43cd-8afd-74512896f3c4',
    lectureTitle:
      '10개 효과만 알아도 영상 퀄리티 UP! 프리미어프로 비디오효과 TOP 10',
    instructor: '코모사전',
    duration: 64,
    description:
      '가장 활용도가 높은 프리미어프로 핵심 비디오 효과 10개를 배워봅니다. 기본이지만 가장 중요한 색 보정 효과부터, 전문가처럼 영상의 흔들림을 잡아주는 흔들림 안정화(Warp Stabilizer), 원하는 부분만 깔끔하게 처리하는 모자이크(Mosaic)와 울트라 키(Ultra Key), 그리고 영상의 분위기를 완전히 바꿔주는 가우시안 흐림(Gaussian Blur), RGB 곡선(RGB Curves) 등, 실전에서 바로 사용할 수 있는 핵심 효과들만 모았습니다.',
    updatedAt: '2025-09-26T00:01:03.587570+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 46,
        name: '사진 · 영상',
      },
    ],
    difficulty: 'easy',
    originalPrice: 53900,
    discountPrice: 53900,
    platform: 'inflearn',
    urlLink:
      'https://www.inflearn.com/course/프리미어프로-자주-쓰는-비디오효과-1',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/339053/cover/01k5qkxzt20smbn92tbxg028g2',
    createdAt: '2025-09-26T00:01:03.587566+09:00',
  },
  {
    id: '6f019040-bfbc-482a-9c83-533f01c0b022',
    lectureTitle: '원리와 실습으로 쌓아가는 파이썬 입문편',
    instructor: '제이스',
    duration: 392,
    description:
      "파이썬 프로그래밍 언어의 입문 강의입니다.  단순히 문자를 출력하고 문법을 따라 치는 형식적이고 따분한 구성이 아닌 '왜' 그리고 '어떻게' 동작하는지에 대한 적절 선에서의 근본적인 원리에 대한 학습과  실제 프로그래밍 실습까지 다루는 강의입니다.   또한 각종 수업 자료가 제공됩니다.",
    updatedAt: '2025-09-26T00:01:03.587533+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 15,
        name: '개발 도구',
      },
      {
        id: 39,
        name: '프로그래밍 언어',
      },
    ],
    difficulty: 'easy',
    originalPrice: 33000,
    discountPrice: 19800,
    platform: 'inflearn',
    urlLink:
      'https://www.inflearn.com/course/원리와-실습으로-쌓아가는-파이썬-입문',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/338883/cover/01k5xyggb8ghbr7jbjj5b1vpnn',
    createdAt: '2025-09-26T00:01:03.587525+09:00',
  },
  {
    id: '010cfdb8-d991-4f54-b508-5d69e0e241da',
    lectureTitle: '인공지능 탄생과 발전과정을 보면 AI 원리가 보인다.',
    instructor: 'AIDER_College',
    duration: 183,
    description:
      'AI는 갑자기 나타난 기술이 아닙니다. 70년간의 도전과 실패를 이해해야, AI의 현재와 미래를 제대로 볼 수 있습니다. 👉 “AI 역사를 이해하는 순간, 원리와 미래가 함께 보입니다.” 지금 바로 시작하세요!',
    updatedAt: '2025-09-26T00:01:03.587422+09:00',
    averageRating: '0.00',
    categories: [
      {
        id: 8,
        name: '인공지능 기타',
      },
      {
        id: 67,
        name: '자연어 처리',
      },
      {
        id: 76,
        name: '딥러닝 · 머신러닝',
      },
    ],
    difficulty: 'easy',
    originalPrice: 38500,
    discountPrice: 11550,
    platform: 'inflearn',
    urlLink:
      'https://www.inflearn.com/course/인공지능-탄생과-발전과정을-보면-ai',
    thumbnailImg:
      'https://cdn.inflearn.com/public/files/courses/338693/cover/01k4bx420e7ey7aakk9b9sh812',
    createdAt: '2025-09-26T00:01:03.587378+09:00',
  },
]
